CreatePrepaidContractsBulk/conf/esb_sendSMS.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://xmlns.vodafone.hu/BusinessMessage/SmsProxyInterface/SmsProxyService/V1.0" xmlns:v11="http://xmlns.vodafone.hu/TechnicalObject/Common/V1">
<soapenv:Header/>
<soapenv:Body>
	<v1:SendTextSmsV2Request>
		<v11:Header>
			<v11:TraceIdentifier>
				<v11:ApplicationId>prepaidContractBuLK</v11:ApplicationId>
				<v11:ReferenceId>%REFID%</v11:ReferenceId>
				<v11:ServiceId>prepaidContractBULK</v11:ServiceId>
				<v11:SenderTimestamp>%TIMESTAMP%</v11:SenderTimestamp>
			</v11:TraceIdentifier>
			<v11:ClientTimeout>30</v11:ClientTimeout>
		</v11:Header>
		<v1:Source>+36707001118</v1:Source>
		<v1:Destination>%MSISDN%</v1:Destination>
		<v1:Text><![CDATA[%TEXT%]]></v1:Text>
		<v1:StatusReportRequest>0</v1:StatusReportRequest>
	</v1:SendTextSmsV2Request>
</soapenv:Body>
</soapenv:Envelope>
